Tekla Open API Reference for Tekla Structures 2025
BaseWeld.WeldIntermittentTypeEnum Enumeration
 Weld intermittent types.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum WeldIntermittentTypeEnum
Public Enumeration WeldIntermittentTypeEnum
Members
Member name | Value | Description
CONTINUOUS | 0 |  Continuous.
CHAIN_INTERMITTENT | 1 |  Chain intermittent.
STAGGERED_INTERMITTENT | 2 |  Staggered intermittent.
See Also
Reference
Tekla.Structures.Model Namespace